Revit 2026 API

# MenuItem Properties

---

The MenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

MenuItem Class

Autodesk.Revit.UI Namespace